Tekla Open API Reference for Tekla Structures 2025
LineTypes Class
 The LineTypes class defines the possible line types that can be used by the drawing objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.LineTypes
 Tekla.Structures.Drawing.CustomLineType
 Tekla.Structures.Drawing.NormalLineType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class LineTypes : IIsEqual,
	ICloneable
<SerializableAttribute>
Public MustInherit Class LineTypes
	Implements IIsEqual, ICloneable
The LineTypes type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
Custom
 The Custom line type defines a line that is drawn using one of the custom line types, as specified by the CustomLineTypeName.
Equals
 Returns true if the current object and the given object are equal.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns a hash code for the object.
 (Overrides Object.GetHashCode().)
IsEqual
 Compares the current object with an object of the same type.
ToString
 Returns the LineTypes information as a string.
 (Overrides Object.ToString().)
Top
Operators
Name | Description
Equality
 Returns true if the current object and the given object are equal.
Explicit(Int32 to LineTypes)
 Returns the corresponding LineTypes value of the given int value.
Explicit(LineTypes to Int32)
 Returns the corresponding int value of the given LineTypes value.
Inequality
 Returns true if the current object and the given object are not equal.
Top
Fields
Name | Description
DashDot
 The dash dotted line (--.--.).
DashDoubleDot
 The dash double dotted line (-..-..-).
DashedLine
 The dashed line (-----).
DottedLine
 The dotted line (.....).
SlashDash
 The slash dash line (-- - -- -).
SlashedLine
 The slashed line (- - -).
SolidLine
 The solid line (default).
UndefinedLine
 The line type is undefined.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace